void Mission() {
  TrackLineColor(0);       // สีของเส้น 1 = ดำ , 0 = ขาว
  ModeSpdPID(0, 100, -25); // โหมดคิดเอง
  // ModeSpdPID(1, 100, -100); // // โหมด PID ปกติพื้นฐานทั่วไป
  // ModeSpdPID(2, 60, -60); // โหมดโค้งเยอะๆ แต่จะวิ่งช้า
  // ModeSpdPID(3, 100, -25); //โหมดคิดเอง หมุนตาม speed
  // ModeSpdPID(4, 100, 0); // โหมด PID ปกติพื้นฐานทั่วไป
  // Dottedline(0);  //ไม่มีเส้นประใส่ 0  >> มีเส้นประใส่ 1

  TrackTime_8_16(80, 0.090, 0.90, 7500);

} //__________________________ปีักกาห้ามลบ_____________________________