#include <SPACE_S.h>

void setup() {


  RobotSetup();  // Setup บอร์ดหุ่นยนต์

  robotsetting();  //ตั้งค่าหุ่นยนต์


  // SW_A();  // รอจนกว่าจะกดปุ่ม A
  // SW_B();        // รอจนกว่าจะกดปุ่ม B
  SW();
  //Mode();
  // delay(100);  // หน่วงเวลา 0.1 วินาที
  Beep(100);
  // TestMotor();
  // คำสั่งเจอแยก >> 'l'=เลี้ยวซ้าย ,'r'=เลี้ยวขวา ,'p'=ตรง ,'s'=หยุด
  // PID จนกว่าจะเจอแยก TrackCross(Speed, Kp , Kd , 'คำสั่งเจอแยก')
  // KP -> ค่าเข้าโค้ง ยิ่งเพิ่มยิ่งเข้าโค้งไว
  // KD -> ค่าทำให้หุ่นนิ่ง ยิ่งเพิ่มยิ่งนิ่ง
  // TrackCrossL(50, 0.028, 0.28, 'r');  // ใช้เซนเซอร์คู่ซ้ายในการนับแยก
  // TrackCrossR(50, 0.028, 0.28, 'r');  // ใช้เซนเซอร์คู่ขวาในการนับแยก
  // TrackCrossC(50, 0.028, 0.28, 'r');  // ใช้เซนเซอร์คู่กลางในการนับแยก
  // TrackTime(50, 0.028, 0.28, 1000);
  // TrackTime_8_16(50, 0.028, 0.28, 1000);
  // PID ด้วยเวลา TrackTime(Speed, Kp , Kd, เวลา); >> เวลา 1000 = 1 วินาที

  // Move(0, -30, 2000);
  //คำสั่งเคลื่อนที่ Move(SpeedLeft,SpeedRight,TimeDelay);


  //__________________________________วางโค้ดใหม่หลังจากนี้บรรทัดนี้ทั้งหมด______________________________________________________________________

  Mission();


  //____________________________________ห้ามวางโค้ดหลังจากบรรทัดนี้____________________________________________________________________________
}

void loop() {
  // อ่าค่าเซนเซอร์โดยใช้ Serial Monitor >> baud rate 115200  //
  MotorStop();
  // for (int i = 0; i < 10; i++) {
  //   Serial.print(analog(i));
  //   Serial.print("\t");
  // }

  // Serial.println("");
  // delay(50);
}
